ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
/**
 * @file test_bin2hex.cpp
 * @author TheSomeMan
 * @date 2020-08-27
 * @copyright Ruuvi Innovations Ltd, license BSD-3-Clause.
 */

#include "nrf52fw.h"
#include <string>
#include <driver/gpio.h>
#include <driver/spi_master.h>
#include "gtest/gtest.h"
#include "esp_log_wrapper.hpp"
#include "esp_err.h"
#include "freertos/FreeRTOS.h"
#include "libswd.h"
#include "nrf52swd.h"

using namespace std;

/*** Google-test class implementation
 * *********************************************************************************/

class TestNRF52Swd;
static TestNRF52Swd *g_pTestClass;

extern "C" {

typedef struct spi_device_t
{
    int stub;
} spi_device_t;

const char *
os_task_get_name(void)
{
    static const char g_task_name[] = "main";
    return const_cast<char *>(g_task_name);
}

} // extern "C"

class MemSegment
{
public:
    uint32_t         segmentAddr;
    vector<uint32_t> data;

    MemSegment(const uint32_t addr, const uint32_t num_words, const uint32_t *p_buf)
        : segmentAddr(addr)
    {
        for (uint32_t i = 0; i < num_words; ++i)
        {
            this->data.push_back(p_buf[i]);
        }
    }

    void
    append(const uint32_t addr, const uint32_t num_words, const uint32_t *p_buf)
    {
        const uint32_t segmentEndAddr = this->segmentAddr + this->data.size() * sizeof(uint32_t);
        assert(addr == segmentEndAddr);
        for (uint32_t i = 0; i < num_words; ++i)
        {
            this->data.push_back(p_buf[i]);
        }
    }
};

class TestNRF52Swd : public ::testing::Test
{
private:
protected:
    void
    SetUp() override
    {
        esp_log_wrapper_init();
        g_pTestClass           = this;
        this->m_vTaskDelay_cnt = 0;
        {
            const gpio_config_t gpio_cfg  = { 0 };
            this->m_gpio_config           = gpio_cfg;
            this->m_gpio_config_result    = ESP_OK;
            this->m_gpio_nrf52_nrst_level = ~0U;
            this->m_gpio_set_level_result = ESP_OK;
        }
        {
            this->m_spi_host                      = (spi_host_device_t)-1;
            const spi_bus_config_t spi_buf_config = { 0 };
            this->m_spi_bus_config                = spi_buf_config;
            this->m_spi_dma_chan                  = -1;
            this->m_spi_bus_initialize_result     = ESP_OK;
            this->m_spi_bus_free_result           = ESP_OK;
        }
        {
            this->m_spi_add_device_host                    = (spi_host_device_t)-1;
            const spi_device_interface_config_t dev_config = { 0 };
            this->m_spi_add_device_config                  = dev_config;
            this->m_spi_add_device_desc.stub               = 0;
            this->m_spi_add_device_result                  = ESP_OK;
            this->m_spi_remove_device_result               = ESP_OK;
        }
        {
            this->m_libswd_init_failed = false;
            libswd_ctx_t libswd_ctx    = { nullptr };
            this->m_libswd_ctx         = libswd_ctx;
        }

        {
            this->m_libswd_debug_init_result    = 0;
            this->m_libswd_debug_init_operation = (libswd_operation_t)0;
        }
        {
            this->m_libswd_dap_detect_operation = (libswd_operation_t)0;
            this->m_libswd_dap_detect_idcode    = 0;
            this->m_libswd_dap_detect_result    = 0;
        }
        {
            this->m_libswd_debug_halt_operation = (libswd_operation_t)0;
            this->m_libswd_debug_halt_result    = 0;
        }
        {
            this->m_libswd_debug_run_operation = (libswd_operation_t)0;
            this->m_libswd_debug_run_result    = 0;
        }
        {
            this->m_libswd_read_int_32_operation = (libswd_operation_t)0;
            this->m_libswd_read_int_32_result    = 0;
        }
        {
            this->m_libswd_write_int_32_operation       = (libswd_operation_t)0;
            this->m_libswd_write_int_32_cnt_before_fail = 0;
        }
        {
            this->m_nvmc_reg_ready_cnt             = 0;
            this->m_nvmc_reg_ready_cnt_before_fail = 0;
        }
        {
            this->m_nvmc_reg_config_cnt_before_fail = 0;
        }
    }

    void
    TearDown() override
    {
        g_pTestClass = nullptr;
        esp_log_wrapper_deinit();
        this->m_memSegmentsRead.clear();
        this->m_memSegmentsWrite.clear();
    }

public:
    TestNRF52Swd();

    ~TestNRF52Swd() override;

    uint32_t m_vTaskDelay_cnt;

    gpio_config_t m_gpio_config;
    esp_err_t     m_gpio_config_result;
    uint32_t      m_gpio_nrf52_nrst_level;
    esp_err_t     m_gpio_set_level_result;

    spi_host_device_t m_spi_host;
    spi_bus_config_t  m_spi_bus_config;
    int               m_spi_dma_chan;
    esp_err_t         m_spi_bus_initialize_result;
    esp_err_t         m_spi_bus_free_result;

    spi_host_device_t             m_spi_add_device_host;
    spi_device_interface_config_t m_spi_add_device_config;
    spi_device_t                  m_spi_add_device_desc;
    esp_err_t                     m_spi_add_device_result;
    esp_err_t                     m_spi_remove_device_result;

    libswd_ctx_t    m_libswd_ctx;
    libswd_driver_t m_libswd_driver;
    bool            m_libswd_init_failed;

    int                m_libswd_debug_init_result;
    libswd_operation_t m_libswd_debug_init_operation;

    libswd_operation_t m_libswd_dap_detect_operation;
    int                m_libswd_dap_detect_idcode;
    int                m_libswd_dap_detect_result;

    libswd_operation_t m_libswd_debug_halt_operation;
    int                m_libswd_debug_halt_result;

    libswd_operation_t m_libswd_debug_run_operation;
    int                m_libswd_debug_run_result;

    vector<MemSegment> m_memSegmentsWrite;
    vector<MemSegment> m_memSegmentsRead;

    libswd_operation_t m_libswd_read_int_32_operation;
    int                m_libswd_read_int_32_result;

    libswd_operation_t m_libswd_write_int_32_operation;
    uint32_t           m_libswd_write_int_32_cnt_before_fail;

