ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
    uint32_t m_nvmc_reg_ready_cnt;
    uint32_t m_nvmc_reg_ready_cnt_before_fail;

    uint32_t m_nvmc_reg_config_cnt_before_fail;
    uint32_t m_nvmc_reg_erase_all_cnt_before_fail;

    bool
    write_mem(const uint32_t addr, const uint32_t num_words, const uint32_t *p_buf)
    {
        this->m_memSegmentsWrite.emplace_back(addr, num_words, p_buf);
        if ((0x4001E000UL + 0x504U) == addr)
        {
            if (this->m_nvmc_reg_config_cnt_before_fail > 0)
            {
                if (0 == --this->m_nvmc_reg_config_cnt_before_fail)
                {
                    return false;
                }
            }
        }
        else if ((0x4001E000UL + 0x50CU) == addr)
        {
            if (this->m_nvmc_reg_erase_all_cnt_before_fail > 0)
            {
                if (0 == --this->m_nvmc_reg_erase_all_cnt_before_fail)
                {
                    return false;
                }
            }
        }
        return true;
    }

    bool
    read_mem(const uint32_t addr, const uint32_t num_words, uint32_t *p_buf)
    {
        assert(0 == (addr % sizeof(uint32_t)));
        for (const auto &x : this->m_memSegmentsRead)
        {
            const uint32_t segmentEndAddr = x.segmentAddr + x.data.size() * sizeof(uint32_t);
            if ((addr >= x.segmentAddr) && (addr < segmentEndAddr))
            {
                const uint32_t offset = (addr - x.segmentAddr) / sizeof(uint32_t);
                for (uint32_t i = 0; i < num_words; ++i)
                {
                    p_buf[i] = x.data[offset + i];
                }
                return true;
            }
        }
        return false;
    }
};

TestNRF52Swd::TestNRF52Swd()
    : Test()
{
}

TestNRF52Swd::~TestNRF52Swd() = default;

extern "C" {

void
vTaskDelay(const TickType_t xTicksToDelay)
{
    g_pTestClass->m_vTaskDelay_cnt += 1;
}

esp_err_t
gpio_config(const gpio_config_t *pGPIOConfig)
{
    g_pTestClass->m_gpio_config = *pGPIOConfig;
    return g_pTestClass->m_gpio_config_result;
}

esp_err_t
gpio_set_level(gpio_num_t gpio_num, uint32_t level)
{
    assert(0 != ((1ULL << (uint32_t)gpio_num) & g_pTestClass->m_gpio_config.pin_bit_mask));
    g_pTestClass->m_gpio_nrf52_nrst_level = level;
    return g_pTestClass->m_gpio_set_level_result;
}

esp_err_t
spi_bus_initialize(spi_host_device_t host, const spi_bus_config_t *bus_config, int dma_chan)
{
    g_pTestClass->m_spi_host       = host;
    g_pTestClass->m_spi_bus_config = *bus_config;
    g_pTestClass->m_spi_dma_chan   = dma_chan;
    return g_pTestClass->m_spi_bus_initialize_result;
}

esp_err_t
spi_bus_free(spi_host_device_t host)
{
    return g_pTestClass->m_spi_bus_free_result;
}

esp_err_t
spi_bus_add_device(spi_host_device_t host, const spi_device_interface_config_t *dev_config, spi_device_handle_t *handle)
{
    g_pTestClass->m_spi_add_device_host   = host;
    g_pTestClass->m_spi_add_device_config = *dev_config;
    *handle                               = &g_pTestClass->m_spi_add_device_desc;
    return g_pTestClass->m_spi_add_device_result;
}

esp_err_t
spi_bus_remove_device(spi_device_handle_t handle)
{
    assert(handle == &g_pTestClass->m_spi_add_device_desc);
    g_pTestClass->m_spi_add_device_host = (spi_host_device_t)-1;
    return g_pTestClass->m_spi_remove_device_result;
}

libswd_ctx_t *
libswd_init(void)
{
    if (g_pTestClass->m_libswd_init_failed)
    {
        return nullptr;
    }
    g_pTestClass->m_libswd_ctx.driver = &g_pTestClass->m_libswd_driver;

    g_pTestClass->m_libswd_ctx.config.initialized = LIBSWD_TRUE;
    return &g_pTestClass->m_libswd_ctx;
}

int
libswd_deinit(libswd_ctx_t *libswdctx)
{
    assert(&g_pTestClass->m_libswd_ctx == libswdctx);
    return 0;
}

int
libswd_log_level_set(libswd_ctx_t *libswdctx, libswd_loglevel_t loglevel)
{
    assert(nullptr != libswdctx);
    libswdctx->config.loglevel = loglevel;
    return 0;
}

int
libswd_debug_init(libswd_ctx_t *libswdctx, libswd_operation_t operation)
{
    assert(&g_pTestClass->m_libswd_ctx == libswdctx);
    g_pTestClass->m_libswd_debug_init_operation = operation;
    return g_pTestClass->m_libswd_debug_init_result;
}

int
libswd_dap_detect(libswd_ctx_t *libswdctx, libswd_operation_t operation, int **idcode)
{
    assert(&g_pTestClass->m_libswd_ctx == libswdctx);
    g_pTestClass->m_libswd_dap_detect_operation = operation;

    *idcode = &g_pTestClass->m_libswd_dap_detect_idcode;
    return g_pTestClass->m_libswd_dap_detect_result;
}

int
libswd_debug_halt(libswd_ctx_t *libswdctx, libswd_operation_t operation)
{
    assert(&g_pTestClass->m_libswd_ctx == libswdctx);
    g_pTestClass->m_libswd_debug_halt_operation = operation;
    return g_pTestClass->m_libswd_debug_halt_result;
}

int
libswd_debug_run(libswd_ctx_t *libswdctx, libswd_operation_t operation)
{
    assert(&g_pTestClass->m_libswd_ctx == libswdctx);
    g_pTestClass->m_libswd_debug_run_operation = operation;
    return g_pTestClass->m_libswd_debug_run_result;
}

int
libswd_memap_read_int_32(libswd_ctx_t *libswdctx, libswd_operation_t operation, int addr, int count, int *data)
{
    assert(&g_pTestClass->m_libswd_ctx == libswdctx);
    g_pTestClass->m_libswd_read_int_32_operation = operation;
    if (0x4001E400UL == addr)
    {
        if (0 == g_pTestClass->m_nvmc_reg_ready_cnt)
        {
            *data = 1;
        }
        else
        {
            g_pTestClass->m_nvmc_reg_ready_cnt -= 1;
            *data = 0;
        }
        if (0 == g_pTestClass->m_nvmc_reg_ready_cnt_before_fail)
        {
            return -1;
        }
        else
        {
            g_pTestClass->m_nvmc_reg_ready_cnt_before_fail -= 1;
            return 0;
        }
    }
    else
    {
        if (!g_pTestClass->read_mem((uint32_t)addr, (uint32_t)count, (uint32_t *)data))
        {
            return -1;
        }
        return g_pTestClass->m_libswd_read_int_32_result;
    }
}

int
libswd_memap_write_int_32(libswd_ctx_t *libswdctx, libswd_operation_t operation, int addr, int count, int *data)
{
    assert(&g_pTestClass->m_libswd_ctx == libswdctx);
    g_pTestClass->m_libswd_write_int_32_operation = operation;
    if (!g_pTestClass->write_mem((uint32_t)addr, (uint32_t)count, (uint32_t *)data))
    {
        return -1;
    }
    if (g_pTestClass->m_libswd_write_int_32_cnt_before_fail > 0)
    {
        if (0 == --g_pTestClass->m_libswd_write_int_32_cnt_before_fail)
        {
            return -1;
        }
    }
    return 0;
}

