ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
} // extern "C"

#define TEST_CHECK_LOG_RECORD(level_, msg_) ESP_LOG_WRAPPER_TEST_CHECK_LOG_RECORD("SWD", level_, msg_)

#define TEST_CHECK_LOG_RECORD_WITH_FUNC(level_, func_, msg_) \
    ESP_LOG_WRAPPER_TEST_CHECK_LOG_RECORD_WITH_FUNC("SWD", level_, func_, msg_)

/*** Unit-Tests
 * *******************************************************************************************************/

TEST_F(TestNRF52Swd, init_gpio_cfg_nreset_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init_gpio_cfg_nreset());
    ASSERT_EQ(1ULL << (unsigned)GPIO_NUM_17, this->m_gpio_config.pin_bit_mask);
    ASSERT_EQ(GPIO_MODE_OUTPUT, this->m_gpio_config.mode);
    ASSERT_EQ(1, this->m_gpio_config.pull_up_en);
    ASSERT_EQ(0, this->m_gpio_config.pull_down_en);
    ASSERT_EQ(GPIO_INTR_DISABLE, this->m_gpio_config.intr_type);
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_gpio_cfg_nreset_fail) // NOLINT
{
    this->m_gpio_config_result = ESP_FAIL;
    ASSERT_FALSE(nrf52swd_init_gpio_cfg_nreset());

    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf52swd_init_gpio_cfg_nreset",
        "gpio_config(nRF52 nRESET) failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_spi_init_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init_spi_init());

    ASSERT_EQ(HSPI_HOST, this->m_spi_host);
    ASSERT_EQ(0, this->m_spi_dma_chan);
    ASSERT_EQ(GPIO_NUM_16, this->m_spi_bus_config.mosi_io_num);
    ASSERT_EQ(GPIO_NUM_NC, this->m_spi_bus_config.miso_io_num);
    ASSERT_EQ(GPIO_NUM_15, this->m_spi_bus_config.sclk_io_num);
    ASSERT_EQ(GPIO_NUM_NC, this->m_spi_bus_config.quadwp_io_num);
    ASSERT_EQ(GPIO_NUM_NC, this->m_spi_bus_config.quadhd_io_num);
    ASSERT_EQ(0, this->m_spi_bus_config.max_transfer_sz);
    ASSERT_EQ(0, this->m_spi_bus_config.flags);
    ASSERT_EQ(0, this->m_spi_bus_config.intr_flags);

    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_spi_init_fail) // NOLINT
{
    this->m_spi_bus_initialize_result = ESP_FAIL;
    ASSERT_FALSE(nrf52swd_init_spi_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_init_spi_init", "spi_bus_initialize failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_spi_add_device_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init_spi_add_device());

    ASSERT_EQ(HSPI_HOST, this->m_spi_add_device_host);
    ASSERT_EQ(0, this->m_spi_add_device_config.command_bits);
    ASSERT_EQ(0, this->m_spi_add_device_config.address_bits);
    ASSERT_EQ(0, this->m_spi_add_device_config.dummy_bits);
    ASSERT_EQ(0, this->m_spi_add_device_config.mode);
    ASSERT_EQ(0, this->m_spi_add_device_config.duty_cycle_pos);
    ASSERT_EQ(0, this->m_spi_add_device_config.cs_ena_pretrans);
    ASSERT_EQ(0, this->m_spi_add_device_config.cs_ena_posttrans);
    ASSERT_EQ(2000000, this->m_spi_add_device_config.clock_speed_hz);
    ASSERT_EQ(0, this->m_spi_add_device_config.input_delay_ns);
    ASSERT_EQ(-1, this->m_spi_add_device_config.spics_io_num);
    ASSERT_EQ(SPI_DEVICE_3WIRE | SPI_DEVICE_HALFDUPLEX | SPI_DEVICE_BIT_LSBFIRST, this->m_spi_add_device_config.flags);
    ASSERT_EQ(24, this->m_spi_add_device_config.queue_size);
    ASSERT_EQ(nullptr, this->m_spi_add_device_config.pre_cb);
    ASSERT_EQ(nullptr, this->m_spi_add_device_config.post_cb);

    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_spi_add_device_fail) // NOLINT
{
    this->m_spi_add_device_result = ESP_FAIL;
    ASSERT_FALSE(nrf52swd_init_spi_add_device());
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_init_spi_add_device", "spi_bus_add_device failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_ok_deinit_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_NE(nullptr, this->m_libswd_ctx.driver);
    ASSERT_NE(nullptr, this->m_libswd_ctx.driver->device);
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_debug_init_operation);
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    nrf52swd_deinit();
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_remove_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_free");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_ok_deinit_fail_at_spi_bus_remove_device) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_NE(nullptr, this->m_libswd_ctx.driver);
    ASSERT_NE(nullptr, this->m_libswd_ctx.driver->device);
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_debug_init_operation);
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_spi_remove_device_result = ESP_FAIL;
    nrf52swd_deinit();
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_remove_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_deinit: spi_bus_remove_device failed, err=-1");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_free");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_ok_deinit_fail_at_spi_bus_free) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_NE(nullptr, this->m_libswd_ctx.driver);
    ASSERT_NE(nullptr, this->m_libswd_ctx.driver->device);
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_debug_init_operation);
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_spi_bus_free_result = ESP_FAIL;
    nrf52swd_deinit();
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_remove_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_free");
    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_deinit: spi_bus_free failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_failed_on_init_gpio_cfg_nreset) // NOLINT
{
    this->m_gpio_config_result = ESP_FAIL;
    ASSERT_FALSE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf52swd_init_gpio_cfg_nreset",
        "gpio_config(nRF52 nRESET) failed, err=-1");
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

