ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
TEST_F(TestNRF52Swd, init_failed_on_init_spi) // NOLINT
{
    this->m_spi_bus_initialize_result = ESP_FAIL;
    ASSERT_FALSE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_init_spi_init", "spi_bus_initialize failed, err=-1");
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_failed_on_spi_add_device) // NOLINT
{
    this->m_spi_add_device_result = ESP_FAIL;
    ASSERT_FALSE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_init_spi_add_device", "spi_bus_add_device failed, err=-1");
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_free");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_failed_on_libswd_init) // NOLINT
{
    this->m_libswd_init_failed = true;
    ASSERT_FALSE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_init_internal", "libswd_init failed, err=-1");
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_remove_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_free");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, init_failed_on_libswd_debug_init) // NOLINT
{
    this->m_libswd_debug_init_result = -1;
    ASSERT_FALSE(nrf52swd_init());

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_libswd_debug_init", "libswd_debug_init failed, err=-1");
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_deinit");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_remove_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_free");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_reset_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init_gpio_cfg_nreset());
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    ASSERT_EQ(~0U, this->m_gpio_nrf52_nrst_level);
    ASSERT_TRUE(nrf52swd_reset(true));
    ASSERT_EQ(0U, this->m_gpio_nrf52_nrst_level);
    ASSERT_TRUE(nrf52swd_reset(false));
    ASSERT_EQ(1U, this->m_gpio_nrf52_nrst_level);

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_reset_fail) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init_gpio_cfg_nreset());
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_gpio_set_level_result = ESP_FAIL;
    ASSERT_EQ(~0U, this->m_gpio_nrf52_nrst_level);
    ASSERT_FALSE(nrf52swd_reset(true));

    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_reset", "gpio_set_level failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_check_id_code_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_libswd_dap_detect_idcode = 0x2ba01477;
    ASSERT_TRUE(nrf52swd_check_id_code());
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_dap_detect");
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "IDCODE: 0x2ba01477");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_check_id_code_fail_wrong_id_code) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_libswd_dap_detect_idcode = -1;
    ASSERT_FALSE(nrf52swd_check_id_code());
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_dap_detect");
    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "Wrong nRF52 ID code 0xffffffff (expected 0x2ba01477)");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_check_id_code_fail_dap_detect) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_libswd_dap_detect_result = ESP_FAIL;
    ASSERT_FALSE(nrf52swd_check_id_code());
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_dap_detect");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_check_id_code", "libswd_dap_detect failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

