ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
TEST_F(TestNRF52Swd, nrf52swd_debug_halt_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    ASSERT_TRUE(nrf52swd_debug_halt());
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_debug_halt_operation);
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_debug_halt_failed) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_libswd_debug_halt_result = -1;
    ASSERT_FALSE(nrf52swd_debug_halt());
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_debug_halt", "libswd_debug_halt failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_debug_run_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    ASSERT_TRUE(nrf52swd_debug_run());
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_debug_run_operation);
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "Run nRF52 firmware");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_debug_run_failed) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_libswd_debug_run_result = -1;
    ASSERT_FALSE(nrf52swd_debug_run());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "Run nRF52 firmware");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_debug_run", "libswd_debug_run failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_read_reg_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    const uint32_t reg_addr = 0x00010000U;
    const uint32_t exp_val  = 1234U;

    this->m_memSegmentsRead.emplace_back(reg_addr, 1, &exp_val);

    uint32_t val = 0;
    ASSERT_TRUE(nrf52swd_read_reg(reg_addr, &val));
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_read_int_32_operation);
    ASSERT_EQ(exp_val, val);

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_read_reg_fail) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    const uint32_t reg_addr = 0x00010000U;
    const uint32_t exp_val  = 1234U;

    this->m_memSegmentsRead.emplace_back(reg_addr, 1, &exp_val);

    uint32_t val                      = 0;
    this->m_libswd_read_int_32_result = -1;
    ASSERT_FALSE(nrf52swd_read_reg(reg_addr, &val));
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_read_int_32_operation);

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_read_reg: libswd_memap_read_int_32(0x00010000) failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_write_reg_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    const uint32_t reg_addr = 0x00010000U;
    const uint32_t val      = 1234U;

    ASSERT_TRUE(nrf52swd_write_reg(reg_addr, val));
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_write_int_32_operation);
    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(reg_addr, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[0].data.size());
        ASSERT_EQ(val, this->m_memSegmentsWrite[0].data[0]);
    }

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_write_reg_fail) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    const uint32_t reg_addr = 0x00010000U;
    const uint32_t val      = 1234U;

    this->m_libswd_write_int_32_cnt_before_fail = 1;
    ASSERT_FALSE(nrf52swd_write_reg(reg_addr, val));
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_write_int_32_operation);

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_write_reg: libswd_memap_write_int_32(0x00010000) failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nvmc_is_ready_or_err_ok_ready) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

