ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
    this->m_nvmc_reg_ready_cnt             = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail = 1;

    bool result = false;
    ASSERT_TRUE(nrf51swd_nvmc_is_ready_or_err(&result));
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_read_int_32_operation);
    ASSERT_TRUE(result);

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nvmc_is_ready_or_err_ok_not_ready) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 1U;
    this->m_nvmc_reg_ready_cnt_before_fail = 2;

    bool result = false;
    ASSERT_FALSE(nrf51swd_nvmc_is_ready_or_err(&result));
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_read_int_32_operation);

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nvmc_is_ready_or_err_fail) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail = 0;

    bool result = false;
    ASSERT_TRUE(nrf51swd_nvmc_is_ready_or_err(&result));
    ASSERT_EQ(LIBSWD_OPERATION_EXECUTE, this->m_libswd_read_int_32_operation);
    ASSERT_FALSE(result);

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_read_reg: libswd_memap_read_int_32(0x4001e400) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf51swd_nvmc_is_ready_or_err",
        "nrf52swd_read_reg(REG_READY) failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf51swd_nvmc_wait_while_busy_ok_0) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail = 1;

    ASSERT_TRUE(nrf51swd_nvmc_wait_while_busy());
    ASSERT_EQ(0, this->m_vTaskDelay_cnt);

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf51swd_nvmc_wait_while_busy_ok_5) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 5U;
    this->m_nvmc_reg_ready_cnt_before_fail = 6;

    ASSERT_TRUE(nrf51swd_nvmc_wait_while_busy());
    ASSERT_EQ(5, this->m_vTaskDelay_cnt);

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf51swd_nvmc_wait_while_busy_fail_3) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 3U;
    this->m_nvmc_reg_ready_cnt_before_fail = 3;

    ASSERT_FALSE(nrf51swd_nvmc_wait_while_busy());
    ASSERT_EQ(3, this->m_vTaskDelay_cnt);

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_read_reg: libswd_memap_read_int_32(0x4001e400) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf51swd_nvmc_is_ready_or_err",
        "nrf52swd_read_reg(REG_READY) failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nrf52swd_erase_all_ok) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail = 2;

    ASSERT_TRUE(nrf52swd_erase_all());
    ASSERT_EQ(3, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[0].data.size());
        ASSERT_EQ(2U, this->m_memSegmentsWrite[0].data[0]);
    }
    {
        ASSERT_EQ(0x4001E000UL + 0x50CU, this->m_memSegmentsWrite[1].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[1].data.size());
        ASSERT_EQ(1U, this->m_memSegmentsWrite[1].data[0]);
    }
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[2].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[2].data.size());
        ASSERT_EQ(0U, this->m_memSegmentsWrite[2].data[0]);
    }

    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52: Erase all flash");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nrf52swd_erase_all_fail_on_first_wait) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

