ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
    this->m_nvmc_reg_ready_cnt             = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail = 2;

    const uint32_t reg_addr       = 0x00010000U;
    const uint32_t arr_of_vals[5] = { 5, 6, 7, 8, 9 };

    ASSERT_TRUE(nrf52swd_write_mem(reg_addr, sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), arr_of_vals));
    ASSERT_EQ(3, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[0].data.size());
        ASSERT_EQ(1U, this->m_memSegmentsWrite[0].data[0]);
    }
    {
        ASSERT_EQ(reg_addr, this->m_memSegmentsWrite[1].segmentAddr);
        ASSERT_EQ(sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), this->m_memSegmentsWrite[1].data.size());
        ASSERT_EQ(arr_of_vals[0], this->m_memSegmentsWrite[1].data[0]);
        ASSERT_EQ(arr_of_vals[1], this->m_memSegmentsWrite[1].data[1]);
        ASSERT_EQ(arr_of_vals[2], this->m_memSegmentsWrite[1].data[2]);
        ASSERT_EQ(arr_of_vals[3], this->m_memSegmentsWrite[1].data[3]);
        ASSERT_EQ(arr_of_vals[4], this->m_memSegmentsWrite[1].data[4]);
    }
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[2].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[2].data.size());
        ASSERT_EQ(0U, this->m_memSegmentsWrite[2].data[0]);
    }

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nrf52swd_write_mem_fail_on_first_wait) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail = 0;

    const uint32_t reg_addr       = 0x00010000U;
    const uint32_t arr_of_vals[5] = { 5, 6, 7, 8, 9 };

    ASSERT_FALSE(nrf52swd_write_mem(reg_addr, sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), arr_of_vals));
    ASSERT_EQ(0, this->m_memSegmentsWrite.size());

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_read_reg: libswd_memap_read_int_32(0x4001e400) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf51swd_nvmc_is_ready_or_err",
        "nrf52swd_read_reg(REG_READY) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf52swd_write_mem",
        "nrf51swd_nvmc_wait_while_busy failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nrf52swd_write_mem_fail_on_second_wait) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt             = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail = 1;

    const uint32_t reg_addr       = 0x00010000U;
    const uint32_t arr_of_vals[5] = { 5, 6, 7, 8, 9 };

    ASSERT_FALSE(nrf52swd_write_mem(reg_addr, sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), arr_of_vals));
    ASSERT_EQ(2, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[0].data.size());
        ASSERT_EQ(1U, this->m_memSegmentsWrite[0].data[0]);
    }
    {
        ASSERT_EQ(reg_addr, this->m_memSegmentsWrite[1].segmentAddr);
        ASSERT_EQ(sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), this->m_memSegmentsWrite[1].data.size());
        ASSERT_EQ(arr_of_vals[0], this->m_memSegmentsWrite[1].data[0]);
        ASSERT_EQ(arr_of_vals[1], this->m_memSegmentsWrite[1].data[1]);
        ASSERT_EQ(arr_of_vals[2], this->m_memSegmentsWrite[1].data[2]);
        ASSERT_EQ(arr_of_vals[3], this->m_memSegmentsWrite[1].data[3]);
        ASSERT_EQ(arr_of_vals[4], this->m_memSegmentsWrite[1].data[4]);
    }

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_read_reg: libswd_memap_read_int_32(0x4001e400) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf51swd_nvmc_is_ready_or_err",
        "nrf52swd_read_reg(REG_READY) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf52swd_write_mem",
        "nrf51swd_nvmc_wait_while_busy failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nrf52swd_write_mem_fail_on_write_reg_config_wen_wen) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt              = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail  = 2;
    this->m_nvmc_reg_config_cnt_before_fail = 1;

    const uint32_t reg_addr       = 0x00010000U;
    const uint32_t arr_of_vals[5] = { 5, 6, 7, 8, 9 };

    ASSERT_FALSE(nrf52swd_write_mem(reg_addr, sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), arr_of_vals));
    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[0].data.size());
        ASSERT_EQ(1U, this->m_memSegmentsWrite[0].data[0]);
    }

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_write_reg: libswd_memap_write_int_32(0x4001e504) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf52swd_write_mem",
        "nrf52swd_write_reg(REG_CONFIG):=WEN failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

