ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52swd/test_nrf52swd.cpp
TEST_F(TestNRF52Swd, nrf52swd_nrf52swd_write_mem_fail_on_write_reg_config_wen_ren) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt              = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail  = 2;
    this->m_nvmc_reg_config_cnt_before_fail = 2;

    const uint32_t reg_addr       = 0x00010000U;
    const uint32_t arr_of_vals[5] = { 5, 6, 7, 8, 9 };

    ASSERT_FALSE(nrf52swd_write_mem(reg_addr, sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), arr_of_vals));
    ASSERT_EQ(3, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[0].data.size());
        ASSERT_EQ(1U, this->m_memSegmentsWrite[0].data[0]);
    }
    {
        ASSERT_EQ(reg_addr, this->m_memSegmentsWrite[1].segmentAddr);
        ASSERT_EQ(sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), this->m_memSegmentsWrite[1].data.size());
        ASSERT_EQ(arr_of_vals[0], this->m_memSegmentsWrite[1].data[0]);
        ASSERT_EQ(arr_of_vals[1], this->m_memSegmentsWrite[1].data[1]);
        ASSERT_EQ(arr_of_vals[2], this->m_memSegmentsWrite[1].data[2]);
        ASSERT_EQ(arr_of_vals[3], this->m_memSegmentsWrite[1].data[3]);
        ASSERT_EQ(arr_of_vals[4], this->m_memSegmentsWrite[1].data[4]);
    }
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[2].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[2].data.size());
        ASSERT_EQ(0U, this->m_memSegmentsWrite[2].data[0]);
    }

    TEST_CHECK_LOG_RECORD(ESP_LOG_ERROR, "nrf52swd_write_reg: libswd_memap_write_int_32(0x4001e504) failed, err=-1");
    TEST_CHECK_LOG_RECORD_WITH_FUNC(
        ESP_LOG_ERROR,
        "nrf52swd_write_mem",
        "nrf52swd_write_reg(REG_CONFIG):=REN failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Swd, nrf52swd_nrf52swd_write_mem_fail_on_write) // NOLINT
{
    ASSERT_TRUE(nrf52swd_init());
    TEST_CHECK_LOG_RECORD(ESP_LOG_INFO, "nRF52 SWD init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_initialize");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "spi_bus_add_device");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "libswd_debug_init");
    TEST_CHECK_LOG_RECORD(ESP_LOG_DEBUG, "nrf52swd_init ok");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    this->m_nvmc_reg_ready_cnt                  = 0U;
    this->m_nvmc_reg_ready_cnt_before_fail      = 2;
    this->m_libswd_write_int_32_cnt_before_fail = 2;

    const uint32_t reg_addr       = 0x00010000U;
    const uint32_t arr_of_vals[5] = { 5, 6, 7, 8, 9 };

    ASSERT_FALSE(nrf52swd_write_mem(reg_addr, sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), arr_of_vals));
    ASSERT_EQ(2, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(0x4001E000UL + 0x504U, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(1, this->m_memSegmentsWrite[0].data.size());
        ASSERT_EQ(1U, this->m_memSegmentsWrite[0].data[0]);
    }
    {
        ASSERT_EQ(reg_addr, this->m_memSegmentsWrite[1].segmentAddr);
        ASSERT_EQ(sizeof(arr_of_vals) / sizeof(arr_of_vals[0]), this->m_memSegmentsWrite[1].data.size());
        ASSERT_EQ(arr_of_vals[0], this->m_memSegmentsWrite[1].data[0]);
        ASSERT_EQ(arr_of_vals[1], this->m_memSegmentsWrite[1].data[1]);
        ASSERT_EQ(arr_of_vals[2], this->m_memSegmentsWrite[1].data[2]);
        ASSERT_EQ(arr_of_vals[3], this->m_memSegmentsWrite[1].data[3]);
        ASSERT_EQ(arr_of_vals[4], this->m_memSegmentsWrite[1].data[4]);
    }

    TEST_CHECK_LOG_RECORD_WITH_FUNC(ESP_LOG_ERROR, "nrf52swd_write_mem", "libswd_memap_write_int_32 failed, err=-1");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}
